export default [
  {
    title: 'Современный боевой пистолет',
    units: [
      {
        title: 'Предпосылки создания',
      },
      {
        title: 'Конкурс «Грач»',
      },
      {
        title: 'Итоги (новые пистолеты)',
      },
      {
        title: 'ПЯ: общие сведения',
      },
    ],
    banner: {
      title: '<div>Современный</div><div>боевой</div><div>пистолет</div>',
      body: 'В декабре 1990 года Министерство обороны СССР официально выдвинуло тему научно-исследовательских и ' +
          'опытно-конструкторских работ, получившую шифр «Грач», по созданию нового образца штатного личного оружия ' +
          'для действий в ближнем бою.',
      image: 'banner-1.jpg',
    },
  },

  {
    title: 'Пистолеты Ярыгина',
    units: [
      {
        title: 'Общее устройство (конструкция)',
      },
      {
        title: 'Разборка и сборка пистолета',
      },
      {
        title: 'Работа частей и механизмов',
        subUnits: [
          {
            title: 'Цикл работы автоматики',
          },
          {
            title: 'Ударно-спусковой механизм',
          },
        ],
      },
      {
        title: 'Слагаемые успеха',
        subUnits: [
          {
            title: 'Новый комплекс «патрон – оружие»',
          },
          {
            title: 'Апробированный принцип работы автоматики',
          },
          {
            title: 'Апробированная схема механизма запирания и отпирания затвора',
          },
          {
            title: 'Повышенная надёжность механизма извлечения гильзы',
          },
          {
            title: 'Магазин: большая ёмкость, удобное снаряжение',
          },
          {
            title: 'Классический курковый механизм: повышенная безопасность и надёжность',
          },
          {
            title: 'Улучшенная эргономика',
          },
        ],
      },
      {
        title: 'Развитие конструкции',
      },
      {
        title: 'Отзывы специалистов',
      },
    ],
    banner: {
      title: '<div>Пистолеты</div><div>Ярыгина</div>',
      body: 'Пистолет Ярыгина представляет собой пример использования известных и проверенных мировой практикой ' +
          'конструкторских решений, в котором традиционно высокие требования Российской армии к надежности ' +
          'реализованы за счет отработки на параметрическом уровне.',
      image: 'banner-2.jpg',
    },
  },

  {
    title: 'Пистолетное производство ИМЗ',
    units: [
      {
        title: 'Боевые пистолеты выпуска Ижевского механического завода',
        subUnits: [
          {
            title: 'Револьвер системы Наган',
          },
          {
            title: 'Пистолет ТТ',
          },
          {
            title: 'Пистолеты семейства Макарова',
          },
          {
            title: 'Пистолет ПСМ',
          },
          {
            title: 'Пистолеты ПБ и С4М',
          },
        ],
      },
      {
        title: 'Конструкторы пистолетов',
        subUnits: [
          {
            title: 'Плецкий',
          },
          {
            title: 'Шигапов',
          },
          {
            title: 'Дорф',
          },
          {
            title: 'Ившин',
          },
          {
            title: 'Богданов',
          },
          {
            title: 'Варламов',
          },
        ],
      },
      {
        title: 'От идеи до изделия',
      },
    ],
    banner: {
      title: '<div>Пистолетное</div><div>производство</div><div>Ижевского Механического Завода</div>',
      body: 'Осенью 1941 г. пистолетное производство Тульского оружейного завода было перебазировано в Ижевск и с ' +
          'лета 1942 г. сосредоточено на заводе № 622 (в настоящее время – Ижевский механический завод). За эти годы ' +
          'там освоено производство многих моделей боевых пистолетов.',
      image: 'banner-3.jpg',
    },
  },

  {
    title: 'Конструктор Ярыгин',
    units: [
      {
        title: 'Биографическая справка',
      },
      {
        title: 'Награды и почетные звания',
      },
      {
        title: 'Перечень разработанных изделий',
      },
      {
        title: 'От первого лица',
      },
    ],
    banner: {
      title: '<div>Конструктор</div><div>Ярыгин</div>',
      body: 'Раннее увлечение механизмами и оружием, а также авторитет знаменитого в районе земляка – Б.В. Саушкина, ' +
          'одного из родоначальников Ижевского механического института (ныне ИжГТУ имени М.Т.Калашникова), сыграли решающую роль в ' +
          'профессиональной ориентации Владимира Александровича Ярыгина.',
      image: 'banner-4.jpg',
    },
  },

  {
    title: 'О проекте',
    units: [{}],
    banner: {
      image: 'banner-5.png',
      title: '',
      body: '',
    },
  },
];
