export default [
  {
    title: '1. Современный боевой пистолет',
    units: [
      {
        title: '1.1. Предпосылки создания',
      },
      {
        title: '1.2. Конкурс «Грач»',
      },
      {
        title: '1.3. Итоги (новые пистолеты)',
      },
      {
        title: '1.4. ПЯ: общие сведения',
      },
    ],
  },

  {
    title: '2. Пистолет Ярыгина ПЯ',
    units: [
      {
        title: '2.1. Общее устройство (конструкция)',
      },
      {
        title: '2.2. Разборка и сборка пистолета',
      },
      {
        title: '2.3. Работа частей и механизмов',
        subUnits: [
          {
            title: '2.3.1. Цикл работы автоматики',
          },
          {
            title: '2.3.2. Ударно-спусковой механизм',
          },
        ],
      },
      {
        title: '2.4. Слагаемые успеха',
        subUnits: [
          {
            title: '2.4.1. Новый комплекс «патрон – оружие»',
          },
          {
            title: '2.4.2. Апробированный принцип работы автоматики',
          },
          {
            title: '2.4.3. Апробированная схема механизма запирания и отпирания затвора',
          },
          {
            title: '2.4.4. Повышенная надёжность механизма извлечения гильзы',
          },
          {
            title: '2.4.5. Магазин: большая ёмкость, удобное снаряжение',
          },
          {
            title: '2.4.6. Классический курковый механизм: повышенная безопасность и надёжность',
          },
          {
            title: '2.4.7. Улучшенная эргономика',
          },
        ],
      },
      {
        title: '2.5. Развитие конструкции',
      },
      {
        title: '2.6. Отзывы специалистов',
      },
    ],
  },

  {
    title: '3. Пистолетное производство Ижевского механического завода',
    units: [
      {
        title: '3.1. Боевые пистолеты выпуска Ижевского механического завода',
        subUnits: [
          {
            title: '3.1.1. Револьвер системы Наган',
          },
          {
            title: '3.1.2. Пистолет ТТ',
          },
          {
            title: '3.1.3. Пистолеты семейства Макарова',
          },
          {
            title: '3.1.4. Пистолет ПСМ',
          },
          {
            title: '3.1.5. Пистолеты ПБ и С4М',
          },
        ],
      },
      {
        title: '3.2. Конструкторы пистолетов',
        subUnits: [
          {
            title: '3.2.1. Плецкий',
          },
          {
            title: '3.2.2. Шигапов',
          },
          {
            title: '3.2.3. Дорф',
          },
          {
            title: '3.2.4. Ившин',
          },
          {
            title: '3.2.5. Богданов',
          },
          {
            title: '3.2.6. Варламов',
          },
        ],
      },
      {
        title: '3.3 От идеи до изделия',
      },
    ],
  },

  {
    title: '4. Конструктор Ярыгин',
    units: [
      {
        title: '4.1 Биографическая справка',
      },
      {
        title: '4.2 Награды и почетные звания',
      },
      {
        title: '4.3 Перечень разработанных изделий',
      },
      {
        title: '4.4 От первого лица',
      },
    ],
  },
];
